# 1. Используем базовый образ Python
FROM python:3.10-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файлы проекта в рабочую директорию контейнера
COPY . .

# 4. Создаем виртуальную среду Python в контейнере
RUN python -m venv /opt/venv

# 5. Устанавливаем переменную окружения для использования виртуальной среды по умолчанию
ENV PATH="/opt/venv/bin:$PATH"

# 6. Устанавливаем зависимости Python
RUN pip install --no-cache-dir -r requirements.txt

# 7. Определяем команду, которая будет выполнена при запуске контейнера
CMD ["python", "main.py"]
